import React from "react";
import styled from "styled-components";



const UseTerm = () => {
    return (
        <StyledBaseContainer>
            
        <h1>서비스 이용 약관</h1><a href="/">← 뒤로가기</a>

        <b> 제 1 조 (목적)</b>

        이 약관은 30bpm(이하 “당사”이라 한다)이 운영, 제공하는 인터넷 관련 서비스(이하 “groomer link”라 한다)을 이용함에 있어 이용자의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.

        <b> 제 2 조 (정의)</b>

        ① “회원”이라 함은 이 약관에 따라 “당사”와 이용계약을 체결하여 “당사”가 제공하는 서비스를 이용하는 자를 말합니다.

        ② “서비스”라 함은 “회원”이 애견미용샵과 관련된 정보를 다른 사람에게 제공하기 위한 서비스를 말합니다.

        ③  이 약관에 사용되는 용어 중 본 조에서 정하지 아니한 부분은 관계법령 및 일반 관례에 따릅니다.

        <b> 제 3 조 (약관의 명시와 개정)</b>

        ① 회사는 본 약관의 내용과 회사의 상호, 영업소 소재지, 대표자의 성명, 사업자등록번호, 연락처 등을 회원이 알 수 있도록 초기 화면에 게시하거나 기타의 방법으로 회원에게 공지합니다.

        ②  회사는 관련법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다

        ③ “당사”가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행 약관과 함께 “당사”홈페이지에 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다. 다만, 이용자에게 불리하게 약관내용을 변경하는 경우에는 최소한 30일 이전의 유예기간을 두고 공지합니다. 이 경우 “당사”는 개정 전 내용과 개정 후 내용을 명확하게 비교하여 이용자가 알기 쉽도록 표시합니다.

        ④ 회원은 변경된 약관이 공지된 지 15일 이내에 거부의사를 표명할 수 있습니다. 회원이 거부하는 경우 본 서비스 제공자인 회사는 15일의 기간을 정하여 회원에게 사전 통지 후 당해 회원과의 계약을 해지할 수 있습니다. 만약, 회원이 거부의사를 표시하지 않고 서비스를 계속 이용하는 경우에는 동의하는 것으로 간주합니다.

        ⑤ 본 약관에서 규정하지 않은 사항에 관해서는 관계 법령에 따릅니다.

        <b> 제 4 조 (서비스의 제공 및 변경)</b>

        ① “당사”에서 제공하는 서비스를 "groomer link"라 부릅니다.

        ② 미용샵에 대한 정보를 등록하고 공유하는 회원을 “애견미용사”라 칭합니다.

        ③ groomer link에서 제공하는 서비스의 범위는 웹사이트를 통해 애견미용샵 정보를 공유하는 것으로 제한합니다. 정보 공유 외에 발생되는 문제의 책임은 전적으로 회원 본인에게 귀속됩니다.

        <b> 제 5 조 (서비스의 중단)</b>

        ① “당사”는 컴퓨터 등 정보통신설비의 보수 점검, 교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.

        ② 사업종목의 전환, 사업의 포기, 업체 간 통합 등의 이유로 서비스를 제공할 수 없게 되는 경우에는 “당사”에서 정한 방법으로 이용자에게 통지하게 됩니다.

        <b> 제 6 조 (서비스 신청 및 회원가입)</b>

        ① 이용자는 “당사”가 정한 서비스 신청 양식에 따라 정보를 기입한 후 이 약관에 동의한다는 의사표시를 함으로서 회원가입을 신청합니다.

        <b> 제 7 조 (회원 탈퇴 및 자격 상실 등)</b>

        ① 회원은 “당사”에 언제든지 탈퇴를 요청할 수 있으며 “당사”는 즉시 회원 탈퇴를 처리합니다.

        ② 회원이 다음 각 호의 사유에 해당하는 경우, ”당사”는 회원자격을 제한 및 정지시킬 수 있습니다.

        <div>1. 가입 신청 시에 허위 내용을 등록한 경우</div>
        <div>2. 다른 사람의 “당사” 서비스 이용을 방해하거나 그 정보를 도용하는 등 서비스 품질을 위협하는 경우</div>
        <div>3. “당사”를 이용하여 법령 또는 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우</div>
        <div>4. 기타 다음과 같은 행위 등으로 “당사”의 건전한 운영을 해하거나 “당사”의 업무를 방해하는 경우</div>

        1) “당사”의 운영에 관련하여 근거 없는 사실 또는 허위의 사실을 적시하거나 유포하여 “당사”의 명예를 실추시키고 “당사”의 신뢰성을 해하는 경우

        2) “당사”의 운영과정에서 직원에게 폭언 또는 음란한 언행을 하여 업무환경을 심각히 해하는 경우

        3) “당사”의 운영과정에서 이유 없는 잦은 연락이나 소란 또는 협박, 인과관계가 입증되지 않는 피해에 대한 보상 요구 등으로 업무를 방해하는 경우

        ③ “당사”가 회원자격을 상실시키는 경우에는 회원등록을 말소합니다. 이 경우 회원에게 이를 통지하고 회원등록 말소 전에 최소한 30일 이상의 기간을 정하여 소명할 기회를 부여합니다.

        <b> 제 8 조 (회원에 대한 통지)</b>

        ① “당사”가 회원에 대한 통지를 하는 경우, 회원이 “당사”와 미리 약정한 전자우편 주소로 할 수 있습니다.

        ② “당사”는 불특정다수 회원에 대한 통지의 경우 일주일 이상 “당사” 홈페이지에 게시함으로서 개별 통지에 갈음할 수 있습니다. 다만, 회원 본인과 관련하여 중대한 영향을 미치는 사항에 대하여는 개별통지를 합니다.

        <b> 제 9 조 (면책조항)</b>

        ① “당사”는 다음 각 호의 경우로 서비스를 제공할 수 없는 경우 이로 인하여 이용자에게 발생한 손해에 대해서는 책임을 부담하지 않습니다.

        <div>1. 천재지변 또는 이에 준하는 불가항력의 상태가 있는 경우</div>
        <div>2. 서비스 제공을 위하여 회사와 서비스 제휴계약을 체결한 제3자의 고의적인 서비스 방해가 있는 경우</div>
        <div>3. “회사”의 제반 사정으로 서비스를 할 수 없는 경우</div>
        <div>4. 이용자의 귀책사유로 서비스 이용에 장애가 있는 경우</div>
        <div>5. 상기 각 항을 제외한 기타 “회사”의 고의, 과실이 없는 사유로 인한 경우</div>

        ② “당사”는 서비스 및 서비스에 게재된 정보, 자료, 사실의 신뢰도, 정확성 등에 대해서는 보증을 하지 않으며 이로 인해 발생한 손해에 대하여는 책임을 부담하지 아니합니다.

        ③ “당사”는 서비스 개편이나 운영상 또는 “당사”의 긴박한 상황 등에 의해 서비스 전부나 일부를 중단할 필요가 있는 경우 서비스의 제공을 중단할 수 있습니다.

        ④ “당사”는 “회원”의 귀책사유로 인한 서비스 이용 장애에 대한 책임이 면제됩니다.

        ⑤ “당사”는 “회원”이 당사의 서비스 제공으로부터 기대되는 이익을 얻지 못하였거나, 서비스 내용을 숙지하지 못하여 발생하는 손해 등에 대해서는 책임이 면제됩니다.

        ⑥ “당사”는 “회원” 신원을 보증하지 않습니다. 또한 groomer link “회원”이 다른 groomer link “회원”에게 경제적, 정신적, 물질적 피해를 가해도 그 책임은 해당 “회원”에게 있습니다.

        ⑦ “당사”는 “회원”이 본 약관 규정을 위배하여 발생한 손실에 대해서는 책임을 지지 않습니다.

        ⑧ “당사”의 동의 없이 제3자에게 ID또는 “회원”의 권한을 판매 및 양도할 경우 회원 자격 박탈 및 민사청구 및 형사상의 고소 또는 고발이 가능합니다. 또한 이로 인한 모든 피해는 불법으로 회원권한을 판매/양도한 회원에게 귀속됩니다.

        ⑨ “회원”이 작성한 아이디가 본인이 확인 가능한 이메일이 아니거나 연락처 갱신을 하지 않아 “회사”가 전달하는 공지사항이 그 전달 방법인 E-mail과 SMS전송을 통해 전달되지 못하여 발생하는 손해에 대한 책임은 “회원” 본인에게 있습니다.

        ⑩ “회원” 간 혹은 “회원”과 제3자 상호간의 온라인 및 오프라인상에서 이루어진 행위에 대해서는 “회원” 본인에게 책임이 있습니다. 이에 정보 작성 및 공유함에 있어 신중히 작성하여 애견미용사로서 올바른 활동을 하시기 바랍니다.

        <b> 제 10 조 (개인정보취급방침)</b>

        개인정보보호에 관한 사항은 웹사이트에 게시된 당사의 개인정보보호정책에 규정된 내용에 따릅니다.

        <b> 제 11 조 ("당사"의 의무)</b>

        ① “당사”는 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고 안정적으로 서비스를 제공하는 데 최선을 다하여야 합니다.

        ② “당사”는 이용자가 안전하게 인터넷 서비스를 이용할 수 있도록 이용자의 개인정보 보호를 위한 노력을 다합니다.

        <b> 제 12 조 (회원의 ID 및 비밀번호에 대한 의무)</b>

        ① 회원 ID 와 비밀번호에 관한 관리책임은 회원에게 있습니다.

        ② 회원은 자신의 ID및 비밀번호를 제3자에게 이용하게 해서는 안 됩니다.

        ③ 회원이 자신의 ID및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 “당사”에 통보하고 “당사”의 안내가 있는 경우에는 그에 따라야 합니다.

        <b> 제 13 조 (이용자의 의무)</b>

        회원은 다음 행위를 하여서는 안 됩니다.

        ① “회원”은 당사가 제공하는 양식에 맞게 미용샵에 대한 정보를 정확히 기재해야합니다. 미용샵 정보를 정확히 기재하지 않고 발생하는 모든 손실, 손해는 “회원”에게 있습니다. 

        ② “회원”은 이 약관 및 “당사”가 고지하는 내용을 준수하여야 하며, 약관 및 고지내용을 위반하거나 이행하지 아니하여 발생하는 모든 손실, 손해에 대하여 책임을 부담합니다.

        ③ “당사”는 정보 제공에 대하여 어떠한 보증이나 책임도 부담하지 않습니다. 따라서 “회원”은 미용샵 정보 작성 시 스스로의 책임 하에 정보를 작성하여야 합니다.

        ④ “당사”는 “회원” 개인 정보에 대한 보증을 하지 않습니다. 또한 정보 제공 중 발생한 문제의 책임은 전적으로 회원 본인에게 귀속되기에 신중히 검토한 후 서비스를 이용해야 합니다.

        ⑤ “회원”이 직접 입력한 정보는 진실하여야 하며 만일 회원이 허위 기타 부정한 정보를 입력하여 다른 회원에게 피해가 발생할 경우 그에 대한 민, 형사상의 책임을 포함한 일체의 책임은 회원 본인에게 귀속됩니다.

        ⑥ “회원”은 “당사”가 서비스를 안전하게 제공할 수 있도록 “당사”에 협조하여야 하며, “당사”가 “회원”의 이 약관 위반행위를 발견하여 “회원”에게 해당 위반 행위에 대하여 소명을 요청할 경우 “회원”은 “당사”의 요청에 적극 응하여야 합니다.

        ⑦ “회원”은 아래 각 호에 해당하는 행위를 해서는 안됩니다.

        <div>1. groomer link의 회원정보를 부정하게 취득하는 행위</div>
        <div>2. groomer link 홈페이지를 해킹 또는 유사 프로그램을 이용하여 정상적인 운영을 어렵게 하는 행위(바이러스 유포, D-dos 공격 등)</div>
        <div>3. 타인의 ID와 비밀번호를 도용하는 행위</div>
        <div>4. 개인 정보를 허위 또는 타인의 것으로 등록하는 행위</div>
        <div>5. 상대방에 대한 비방 또는 인격모독을 하거나 이를 작성 및 유포하는 행위</div>
        <div>6. 공공질서, 미풍양속에 저해하는 저작물을 등록 또는 유통시키는 행위</div>
        <div>7. 사이트 내에서, 불법적으로 물건을 판매하거나 상행위를 하는 행위</div>
        <div>8. groomer link가 제공하는 미용샵 정보 및 개인정보(미용샵 이름, 미용샵 상세정보, 회원 이름, 회원 연락처 등)을 무단 캡쳐(저장)하는 행위 및 이를 유출하여 외부에 게시하는 경우</div>
        <div>9. groomer link에 대한 허위 사실을 유포하거나 업무방해를 하는 행위</div>

        이상 위 9항 각 호 해당 사항에 명시한 내용을 위반한 회원은 강제 탈퇴 처리 될 수 있으며 민, 형사상의 책임을 지게 됩니다.

        ⑦ groomer link 회원의 권한은 본인이 아닌 타인에게 양도 및 판매가 불가능합니다.

        ⑧ groomer link에서 허용한 정당한 정보 공개가 아닌, 허위 정보를 기재하여 타인 또른 다른 회원의 groomer link 사용을 방해하면 groomer link를 부정하게 이용하는 행위로 간주하여 강제 탈퇴 처리될 수 있으며 이로 인한 피해에 대해 “회사”는 책임지지 않습니다.

        ⑨ 본 약관을 위반하거나, 기타 대한민국 관계 법령에 위반하는 행위에 대해서는 경고 없이 회원이 권한이 박탈되며 이에 대해 “회사”는 “회원”에게 어떠한 보상도 하지 않습니다.

        <b> 제 14 조 (저작권의 귀속 및 이용제한)</b>

        ① “당사”가 작성한 저작물에 대한 저작권, 기타 지적재산권은 “당사”에 귀속합니다.

        ② 이용자는 “당사”를 이용함으로써 얻은 정보 중 “당사”에게 지적재산권이 귀속된 정보를 “당사”의 사전승낙 없이 복제, 송신, 출판, 배포, 방송, 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안 됩니다.

        ③ “당사”는 약정에 따라 이용자에게 귀속된 저작권을 사용하는 경우 해당 이용자에게 통보하여야 합니다.

        ④ 이용자는 “당사”가 제공하는 각종 서비스 등을 이용하는 과정에서 “당사”에 게시 또는 등록한 각종 저작물을 “당사”가 무상으로 사용하는 것을 허락하며, 이는 이용자가 회원을 탈퇴한 경우에도 유효합니다. 단, 이용자가 “당사”에 대해 상기 사용권의 허락을 취소하는 통지를 한 경우에는 그러하지 아니합니다.

        <b> 제 15 조 (회원의 게시물 및 저작권)</b>

        ① 게시물이라 함은 회원이 서비스를 이용하면서 게시한 글, 사진, 각종 파일과 링크 등을 말합니다.

        ③ 회원의 게시물에 의한 손해나 기타 문제가 발생하는 경우, 회원은 이에 대한 책임을 지게 되며, “당사”는 책임을 지지 않습니다.

        ③ “당사”는 다음 각 호에 해당하는 게시물 등을 회원의 사전 동의 없이 임의 게시, 중단, 수정, 삭제, 이동 또는 등록 거부 등의 관련 조치를 할 수 있습니다.

        <div>1.  다른 회원 또는 제3자에게 심한 모욕을 주거나 명예를 손상시키는 내용인 경우</div>
        <div>2. 공공질서 및 미풍양속에 위반되는 내용을 유포하거나 링크시키는 경우</div>
        <div>3. 불법복제 또는 해킹을 조장하는 내용인 경우</div>
        <div>4. 제3자의 저작권을 침해하여 게시중단 요청을 받은 경우</div>
        <div>5. 영리를 목적으로 하는 광고일 경우</div>
        <div>6. 범죄와 결부된다고 객관적으로 인정되는 내용일 경우</div>
        <div>7. 다른 이용자 또는 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우</div>
        <div>8. 사적인 정치적 판단이나 종교적 견해의 내용으로 회사가 서비스 성격에 부합하지 않는다고 판단하는 경우</div>
        <div>9. 회사에서 규정한 게시물 원칙에 어긋나거나, 서비스 성격에 부합하지 않는 경우</div>
        <div>10. 기타 관계법령에 위배된다고 판단되는 경우</div>

        ④ 회원이 게시한 게시물의 저작권은 게시한 회원에게 귀속됩니다. 단, “당사”는 서비스의 운영, 전시,  전송, 배포, 홍보의 목적으로 회원의 별도 허락 없이 무상으로 저작권법에 규정하는 공정한 관행에 합치되게 회원의 게시물을 사용할 수 있습니다.

        ④ “당사”는 전항 이외의 방법으로 회원의 게시물을 이용하고자 하는 경우, 전화, 팩스, 전자우편 등의 방법을 통해 사전에 회원의 동의를 얻어야 합니다.

        ⑥ 회원이 이용계약 해지를 한 경우 타인에 의해 복제된 게시물과 타인의 게시물과 결합되어 제공되는 게시물 등은 삭제되지 않습니다.

        <b> 제 16 조 (분쟁해결)</b>

        ① “당사”는 이용자가 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 해결하기 위해 노력합니다.

        ② 이외 약관에서 기록되지 않은 사항은 대한민국 준거법에 적용합니다.

        <b> 제 17 조 (재판권 및 준거법)</b>

        ① “당사”와 이용자 간에 발생한 분쟁에 관한 소송은 “당사”가 선택하는 법원의 전속관할로 합니다.

        ② “당사”와 이용자 간에 제기된 소송에는 한국법을 적용합니다.

        <b> 제 18 조 (특별규정)</b>

        ① 당 약관에 명시되지 않은 사항은 전자서명법 등에서의 소비자보호에 관한 법률,기타 관련법령의 규정 및 국내(외)표준약관 등에 의합니다.

        <b> [부칙]</b>

        본 약관은 2020 년 12 월 23일부터 적용 됩니다.
        </StyledBaseContainer>
    )
}

export default UseTerm;



const StyledBaseContainer = styled.div`
    width: 100%;
    padding: 5%;
    font-size: 15px;
    a {
        font-weight: bold;
        background: white;
        padding: 10px;
        border-radius: 5px;
    }
    h1 {
        color: black !important;
        text-align: center;
        margin-bottom: 50px;
    }
    b {
        margin: 20px 0 10px;
        display: block;
        font-size: 20px;
    }
`;